#+OPTIONS: num:nil
#+SETUPFILE: ~/devel/ext/org-html-themes/org/theme-readtheorg-local.setup
#+PROPERTY: header-args :noweb-prefix no :noweb no-export :eval no
#+PROPERTY: header-args:elisp :tangle config.el
#+PROPERTY: header-args:scheme :tangle no :exports code
#+PROPERTY: header-args:cfg :tangle no :eval yes :cache yes :exports code :wrap "src text :noweb-ref guix-file"
#+begin_src elisp :exports none
;; -*- lexical-binding: t; -*-
;; generated from config.org
(require 's)
#+end_src
#+begin_src elisp :tangle packages.el :exports none
;; generated from config.org
#+end_src
* flatpaks
#+begin_src scheme :noweb-ref guix-env-var
("XDG_DATA_DIRS" . "$XDG_DATA_DIRS:$HOME/.local/share/flatpak/exports/share")
#+end_src
#+begin_src scheme :noweb-ref guix-pkg
"flatpak" "xdg-desktop-portal-gtk"
#+end_src
#+NAME: flatpak-list
#+begin_src sh :tangle no :results output
flatpak list --app --columns=application | head -n -1
#+end_src

#+RESULTS: flatpak-list
#+begin_example
com.endlessnetwork.aqueducts
com.github.tchx84.Flatseal
com.google.AndroidStudio
com.jetbrains.IntelliJ-IDEA-Community
com.spotify.Client
de.blobbyvolley.BlobbyVolley2
io.sourceforge.zaz
net.lutris.Lutris
net.sourceforge.lgames.LBreakoutHD
org.mattdm.icebreaker
org.prismlauncher.PrismLauncher
org.regular_dev.biplanes_revival
org.sugarlabs.MakeThemFall
#+end_example

#+begin_src sh :tangle no :stdin flatpak-list
xargs flatpak install --or-update --noninteractive
#+end_src
